[
  {
    "id": 1,
    "img": "https://devpractice.kz/utils/images/person-1.png",
    "name": "Адилов Таиржан",
    "description": "В 30 лет решил освоить программирование. Данный курс мне нравится: больше практики, чем теории. Ожидал классического урока, но курс рассчитан на самостоятельное изучение (60-75% информации). Преподаватель дает базовые знания, а глубже нужно копать самому — похоже на университетский подход, где лектор дает 20%, а студент исследует остальные 80%. Это мне подходит, хотя привык к индивидуальному обучению."
  },
  {
    "id": 2,
    "img": "https://devpractice.kz/utils/images/person-2.png",
    "name": "Қабдешов Толағай",
    "description": "Курс Python от qazdev впечатляет своей структурой и методикой преподавания. Материал логичен и понятен, что значительно облегчает усвоение информации. Ожидания оправдались, я получил много полезных знаний. Желал бы более широкого покрытия определенных тем и больше практики, но в целом опыт обучения остается положительным. Благодарен за возможность углубить свои знания в Python."
  },
  {
    "id": 3,
    "img": "https://devpractice.kz/utils/images/person-3.png",
    "name": "Блинов Евгений",
    "description": "Курс превзошел ожидания, обеспечив полное погружение в Python. Благодарен менторам за структурированный материал и практический подход, что делает изучение увлекательным. Возможность применять знания в проектах помогает лучшему усвоению материала. Преподаватели четко объясняют даже сложные концепции для начинающих. Курс оставил положительное впечатление, и я чувствую, что приобрел необходимые навыки. Благодарю!"
  },
  {
    "id": 4,
    "img": "https://devpractice.kz/utils/images/person-4.png",
    "name": "Шатный Андрей",
    "description": "Практико-ориентированный подход позволил освоить теорию Python и получить опыт решения реальных задач. Интерактивные упражнения и проекты углубили понимание материала и развили навыки решения проблем. Особенно запомнилось создание приложения списка дел с использованием Tkinter — это дало опыт работы с GUI и понимание обработки исключений и управления файлами. "
  },
  {
    "id": 5,
    "img": "https://devpractice.kz/utils/images/person-5.png",
    "name": "Ермакбаева Елизавета",
    "description": "Курс понравился. Очень нравится обратная связь куратора, всегда выдает информацию вовремя и понятно ее структурирует, отделяет для нас домашние задания, что облегчает процесс их поиска.Очень интересная и понятная подача материала. Оперативный и понятный ответ преподавателя, что в случае затруднительных вопросов все расскажет, покажет и разъяснит по полочкам."
  },
  {
    "id": 6,
    "img": "https://devpractice.kz/utils/images/person-6.png",
    "name": "Досимбекова Лаура",
    "description": "Курс интенсивный и содержательный, требует постоянного обучения и практики. Кураторы и преподаватели всегда на связи, готовы помочь и разъяснить новые темы, обеспечивая качественное обучение. Программа доступна для всех, даже при занятости. Желание продолжать развиваться и учиться не иссякает. Благодарю программу и школу за возможность обучения."
  },
  {
    "id": 7,
    "img": "https://devpractice.kz/utils/images/person-7.png",
    "name": "Сарсенбаев Тойлыбай",
    "description": "Курс впечатляет. Высокое качество видеоуроков и внимание к деталям делают обучение приятным. Материалы организованы грамотно и легко усваиваются. Преподаватель — отличный специалист, доброжелательный и готовый помочь. Его поддержка в онлайн созвонах значительно облегчает учебный процесс. Курс соответствует ожиданиям, постепенно усложняясь и развивая навыки. Рекомендую этот курс."
  },
  {
    "id": 8,
    "img": "https://devpractice.kz/utils/images/person-8.png",
    "name": "Зиянова Кымбат",
    "description": "Курс меня действительно впечатляет. Особенно хочу выделить организацию и стиль преподавания, а также системность и структурированность материала – это аспекты, которые мне особенно приглянулись."
  }
]


